BellaTarget3D_3mm_05_H2_200psi_200psi_Ser/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftSnap, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001; // vertices are written in mm

vertices   // (x y z)   
(
    (-15 -25 -15 )	//0
    ( 15 -25 -15 )
    ( 15  40 -15 )
    (-15  40 -15 )
    (-15 -25  45)	//4
    ( 15 -25  45)
    ( 15  40  45)
    (-15  40  45)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (200 200 200) simpleGrading (1 1 1)
);

edges
(
);

patches         //copied from DICAT shm example "M3_mixing elbow1"
(               
/*    patch maxY 
    (
        (3 7 6 2)
    )
    patch minX
    (
        (0 4 7 3)
    )
    patch maxX
    (
        (2 6 5 1)
    )
    patch minY
    (
        (1 5 4 0)
    )
    patch minZ
    (
        (0 3 2 1)
    )
    patch maxZ
    (
        (4 5 6 7)
    )*/
);
