BellaTarget3D_3mm_05_H2_200psi_200psi_Ser/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*/

// File was generated by SwiftSnap, a Blender 3D addon.

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry	// STL files hier rein
{
    inlet_1.stl	{type triSurfaceMesh; name inlet_1;}
	inlet_2.stl	{type triSurfaceMesh; name inlet_2;}
    vacuum.stl	{type triSurfaceMesh; name vacuum;}
	capillary.stl	{type triSurfaceMesh; name capillary;}
};

castellatedMeshControls
{
    maxLocalCells 10000;	//max cells per CPU core
    maxGlobalCells 200000;	//max cells to use before mesh deletion step //pevious 2000000
    minRefinementCells 0;	//was 0 - zero means no bad cells are allowed during refinement stages
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 1;	// expansion factor between each high & low refinement zone

    
    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    
    features // taken from STL from each .eMesh file created by "SurfaceFeatureExtract"
    (
      {file "inlet_1.eMesh"; level 2;}
	  {file "inlet_2.eMesh"; level 2;}
      {file "capillary.eMesh"; level 2;}
      {file "vacuum.eMesh"; level 0;}
    );
    
     // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

	
	
    
    refinementSurfaces	// Surface-wise min and max refinement level
    { 
      inlet_1 {level (2 3);} // (min max) refinement for whole surface 
	  inlet_2 {level (2 3);} // (min max) refinement for whole surface 
      capillary {level (3 4);} //
      vacuum {level (0 1);}
    }
	
	
	    
    resolveFeatureAngle 80;
	
	
	
    refinementRegions        // In descending levels of fineness
    {
      capillary {mode distance; levels ((1e-5 4) (1e-4 2));} //refinement of level 4 till 5e-4 m, 2 till 1e-3
    }
    allowFreeStandingZoneFaces true;
    //to decide which side of mesh to keep **
    locationInMesh (0.005 0.01 0.02);
	
}

// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 10;
    nRelaxIter 5;
    nFeatureSnapIter 15;
// New settings from openfoam 2.2 onwards for SHMesh

implicitFeatureSnap false; // default is false - detects without doing surfaceFeatureExtract
explicitFeatureSnap true; // default is true
multiRegionFeatureSnap false; // default is false - detects features between multiple surfaces
}



addLayersControls
{
  relativeSizes false;    
  layers
    {
        nozzle {nSurfaceLayers 3;}
		razor {nSurfaceLayers 3;}
    }
  expansionRatio 1.25; 	//1.25
  finalLayerThickness 0.03; 	//0.3
  minThickness 0.025; 		//0.25
  nGrow 0;
  featureAngle 80;		// was 70 //- When not to extrude surface. 0 is flat, 90 is right angle.
//   slipFeatureAngle 30;
  nRelaxIter 3;		//- Max# of snapping relaxation iter. Should stop before upon reaching a correct mesh.
  nSmoothSurfaceNormals 1;	// Number of smoothing iterations of surface normals
  nSmoothNormals 3;		// Number of smoothing iterations of interior mesh movement direction
  nSmoothThickness 10;	// Smooth layer thickness over surface patches
  maxFaceThicknessRatio 0.5;	// Stop layer growth on highly warped cells
  maxThicknessToMedialRatio 0.3; // Reduce layer growth where ratio thickness to medial distance is large //0.3
  minMedianAxisAngle 130;	// Angle used to pick up medial axis points
  nBufferCellsNoExtrude 0;	// Create buffer region for new layer terminations
  nLayerIter 50;		// Overall max number of layer addition iterations
//   nRelaxedIter 20;
}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-14;
    minTetQuality 1e-4;
    minArea -1;
    minTwist 0.05;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    relaxed
    {
        maxNonOrtho 75;
    }
    // Advanced

    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;
// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-5;
// ************************************************************************* //
