BellaTarget3D_3mm_05_H2_200psi_200psi_Ser/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|* OpenFOAM for Windows 18.02 (v1)                                           *|
|* Built by CFD Support, www.cfdsupport.com (based on Symscape).             *|
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet_1
    {
        type            fixedValue;
        value           uniform 300;
    }
    inlet_2
    {
        type            fixedValue;
        value           uniform 300;
    }
    vacuum
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    capillary
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
