BellaTarget3D_3mm_05_H2_200psi_200psi_Ser/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|* OpenFOAM for Windows 18.02 (v1)                                           *|
|* Built by CFD Support, www.cfdsupport.com (based on Symscape).             *|
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 825000;

boundaryField
{
    inlet_1
    {
        type            fixedValue;
        value           uniform 825000;
    }
    inlet_2
    {
        type            fixedValue;
        value           uniform 825000;
    }
    vacuum
    {
        type            inletOutlet;
        inletValue      uniform 825000;
        value           uniform 825000;
    }
    capillary
    {
        type            epsilonWallFunction;
        value           uniform 825000;
    }
}


// ************************************************************************* //
