BellaTarget3D_3mm_05_H2_200psi_200psi_Ser/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

capillary
{
    surfaces
    (
        "capillary.stl"
    );

    // Identify a feature when angle between faces < includedAngle
    includedAngle   150;

    // Do not mark region edges
    geometricTestOnly       yes;

    // Write options

    // Write features to obj format for postprocessing
    writeObj                yes;
}
    
// ************************************************************************* //

inlet
{
    surfaces
    (
        "inlet.stl"
    );

    // Identify a feature when angle between faces < includedAngle
    includedAngle   150;

    // Do not mark region edges
    geometricTestOnly       yes;

    // Write options

    // Write features to obj format for postprocessing
    writeObj                yes;
}

// ************************************************************************* //

vacuum
{
    surfaces
    (
        "vacuum.stl"
    );

    // Identify a feature when angle between faces < includedAngle
    includedAngle   150;

    // Do not mark region edges
    geometricTestOnly       yes;

    // Write options

    // Write features to obj format for postprocessing
    writeObj                yes;
}

// ************************************************************************* //
